Repository: fredatgithub/nUpdate
Catalog: nUpdate/Properties/strings.*.resx
Languages: de, fr

# CancelButtonText
source: Cancel
de: Abbrechen
fr: Annuler

# CloseButtonText
source: Close
de: Schließen
fr: Fermer

# ContinueButtonText
source: Continue
de: Fortfahren
fr: Continuer

# DownloadingProcessRunningExceptionText
source: There is already a download process running.
de: Es wird bereits ein aktiver Download ausgeführt.
fr: Il y a déjà un téléchargement actif exécuté.

# FileDeletingOperationText
source: "Deleting file "{0}"..."
de: "Lösche Datei "{0}"..."
fr: "Supprime le fichier "{0}"..."

# FileRenamingOperationText
source: "Renaming file "{0}" to "{1}"..."
de: "Datei "{0}" wird nach "{1}" umbenannt..."
fr: "Le fichier "{0}" est renommé à "{1}" ..."

# InstallButtonText
source: Install
de: Installieren
fr: Installer

# InstallerCopyingText
source: "Copying {0}..."
de: "Kopiere {0}..."
fr: "Copie {0}..."

# InstallerExtractingFilesText
source: "Extracting files..."
de: "Entpacke Dateien..."
fr: "Extrais les fichiers..."

# InstallerFileInUseError
source: The installer cannot overwrite the file '{0}' because it is being used by another process. Terminate all applications that block the access and try again by pressing "OK".
de: Der Installer kann die Datei '{0}' nicht überschreiben, da sie von einem anderen Prozess verwendet wird. Beenden Sie alle Prozesse, die den Zugriff blockieren und drücken Sie "OK".
fr: L'installateur ne peut pas sufrapper le fichier '{0}' parce qu'il est utilisé par un autre logiciel. Quittez tous les processus qui bloquent l'accès et appuyez "OK".

# InstallerInitializingErrorCaption
source: "Error while iniaitializing the data."
de: "Fehler während der Initialisierung."
fr: "Erreur pendant l'initialisation."

# InstallerUpdatingErrorCaption
source: "Error while updating the application"
de: "Fehler beim Aktualisieren der Anwendung."
fr: "Erreur pendant la mettre à jour du logiciel."

# InvalidSignatureErrorCaption
source: Invalid signature data found.
de: Ungültige Signatur.
fr: Signature invalide

# InvalidSignatureErrorText
source: The signature of the update package is not a valid RSA-signature.
de: Die Signatur des Updatepakets ist keine gültige RSA-Signatur.
fr: La signature du paquet de la mise à jour n'est pas une RSA signature valide.

# MainFolderCreationExceptionText
source: The application's main folder could not be created. {0}
de: Das Hauptverzeichnis für die Updatedaten konnte nicht erstellt werden. {0}
fr: Le répertoire principal pour les données de la mise à jour ne peut pas être créé. {0}

# NetworkConnectionExceptionText
source: No network connection available.
de: Es ist keine Internetverbindung verfügbar.
fr: Une connexion Internet est indisponible.

# NewUpdateDialogAccessText
source: Accesses:
de: Zugriff auf:
fr: Accès à:

# NewUpdateDialogAvailableVersionsText
source: Available versions: {0}
de: Verfügbare Versionen: {0}
fr: Versions disponibles: {0}

# NewUpdateDialogChangelogText
source: Changelog:
fr: Historique des modifications:

# NewUpdateDialogCurrentVersionText
source: Current version: {0}
de: Aktuelle Version: {0}
fr: Version actuelle: {0}

# NewUpdateDialogFilesAccessText
source: File system
de: Dateisystem
fr: Système de fichier

# NewUpdateDialogInfoText
source: New updates can be downloaded for {0}.
de: Es können Aktualisierungen für {0} geladen werden.
fr: Des mises à jour pour {0} peuvent être chargés.

# NewUpdateDialogMultipleUpdatesHeader
source: {0} new updates available.
de: {0} neue Updates verfügbar.
fr: {0} nouvelles mises à jour disponibles.

# NewUpdateDialogProcessesAccessText
source: Processes
de: Prozesse
fr: Processus

# NewUpdateDialogRegistryAccessText
source: Registry
fr: Base de registre

# NewUpdateDialogSingleUpdateHeader
source: {0} new update available.
de: {0} neues Update verfügbar.
fr: {0} nouvelle mise à jour disponible.

# NewUpdateDialogSizeText
source: Total package size: {0}
de: Gesamtpaketgröße: {0}
fr: Grandeur totale du paquet: {0}

# NoUpdateDialogHeader
source: There are no new updates available.
de: Es sind keine neuen Updates verfügbar.
fr: Il n'y a pas de nouvelles mises à jour disponibles.

# NoUpdateDialogInfoText
source: The application is currently up-to-date.
de: Die Anwendung ist auf dem neuesten Stand.
fr: Vous utilisez la version la plus récente du logiciel.

# PackageFileNotFoundExceptionText
source: The update package of version "{0}" could not be found.
de: Das zu überprüfende Updatepaket für Version "{0}" konnte nicht gefunden werden.
fr: Le paquet de la mise à jour à verifier pour la version "{0}" ne peut pas être trouvé.

# PackageNotFoundErrorText
source: The package file couldn't be found.
de: Das Updatepaket konnte nicht gefunden werden.
fr: Le paquet de mise à jour ne peut pas être trouvé.

# PackageSizeCalculationExceptionText
source: The package size couldn't be calculated because an unknown error appeared. Possibly the package file does not exist.
de: Dies Paketgröße konnte auf Grund eines unbekannten Fehlers nicht ermittelt werden. Möglicherweise fehlt das Updatepaket auf dem Server.
fr: La grandeur du paquet ne peut pas être déterminé en raison d'une erreur inconnue. Peut-être le paquet de la mise à jour n'existe pas sur le serveur.

# PackageValidityCheckErrorCaption
source: Error while checking the package's signature.
de: Fehler beim Überprüfen der Signatur des Updatepakets.
fr: Erreur pendant la vérification de la signature du paquet de la mise à jour.

# ProcessStartOperationText
source: "Starting process "{0}"..."
de: "Starte Prozess "{0}"..."
fr: "Démarre le processus "{0}"..."

# ProcessStopOperationText
source: "Terminating process "{1}"..."
de: "Beende Prozess "{0}"..."
fr: "Quitte le processus "{0}"..."

# RegistryNameValuePairDeleteValueOperationText
source: "Deleting name-value-pair "{0}"..."
de: "Lösche Namen-Wertepaar "{0}"..."
fr: "Supprime la nom-valeur paire "{0}"..."

# RegistryNameValuePairSetValueOperationText
source: "Setting value of "{0}" in the registry to "{1}"..."
de: "Setze Wert in der Registry von "{0}" auf "{1}"..."
fr: "Définis la valeur dans la base de registre de "{0}" à "{1}"..."

# RegistrySubKeyCreateOperationText
source: "Creating registry subkey "{0}"..."
de: "Erstelle Unterschlüssel "{0}" in der Registry..."
fr: "Créer la sous-clé "{0}" dans la base de registre..."

# RegistrySubKeyDeleteOperationText
source: "Deleting registry subkey "{0}"..."
de: "Lösche Unterschlüssel "{0}" in der Registry..."
fr: "Supprime la sous-clé "{0}" dans la base de registre..."

# SearchProcessRunningExceptionText
source: There is already a search process running.
de: Es wird bereits eine Updatesuche ausgeführt.
fr: Il y a déjà une recherche exécuté pour les mises à jour.

# ServiceStartOperationText
source: "Starting service "{0}"..."
de: "Starte Dienst "{0}"..."
fr: "Démarre le service "{0}"..."

# ServiceStopOperationText
source: "Stopping service "{0}"..."
de: "Stoppe Dienst "{0}"..."
fr: "Arrête le service "{0}"..."

# SignatureNotMatchingErrorText
source: nUpdate will cancel the installation of the update packages and delete them unrecoverably.
de: nUpdate wird die Installation abbrechen und das Paket löschen.
fr: nUpdate va annuler l'installation et supprimer le paquet.

# StatisticsScriptExceptionText
source: An error occured while trying to transfer data for the statistics. Please report this problem to the developer of the program in order to make him capable of fixing it. Response from the PHP-script: {0}
de: Beim Datentrasfer mit dem Statistikserver ist ein Fehler aufgetreten. Bitte melden Sie diesen Fehler dem Entwickler, damit dieser ihn beheben kann. Antwort/Rückgabe des PHP-Scripts: {0}
fr: Pendant le transfert des données avec le serveur statistiques une erreur est apparu. Signalez cette erreur pour réparer celui. La rèponse du PHP script: {0}

# UpdateDownloadDialogLoadingHeader
source: Downloading updates...
de: Updates werden heruntergeladen...
fr: Mises à jour sont téléchargés...

# UpdateDownloadDialogLoadingInfo
source: Please wait while the available updates are downloaded... ({0}%)
de: Bitte warten Sie, während die Updates heruntergeladen werden... ({0}%)
fr: Attendez, s'il vous plait, pendant les mises à jour sont téléchargé... ({0}%)

# UpdateSearchDialogHeader
source: Searching for updates...
de: Suche nach Aktualisierungen...
fr: Rechercher des mises à jour

# UpdateSearchErrorCaption
source: Error while searching for updates.
de: Fehler bei der Updatesuche.
fr: Erreur pendant la mettre à jour.

# NewUpdateDialogServicesAccessText
source: Services
de: Dienste
